lopple/arduino_core_ch32/cores/arduino/ch32/PortNames.h
/*
 *******************************************************************************
 * Copyright (c) 2016, STMicroelectronics
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 Modified 1 may 2023 by TempersLee
 */
#ifndef _PORTNAMES_H
#define _PORTNAMES_H

#include "ch32_def.h"

#ifdef __cplusplus
extern "C" {
#endif

extern GPIO_TypeDef *GPIOPort[];

typedef enum {
  FirstPort = 0x00,
  PortA = FirstPort,
#if defined GPIOB_BASE
  PortB,
#endif
#if defined GPIOC_BASE
  PortC,
#endif
#if defined GPIOD_BASE
  PortD,
#endif
#if defined GPIOE_BASE
  PortE,
#endif
#if defined GPIOF_BASE
  PortF,
#endif
#if defined GPIOG_BASE
  PortG,
#endif
#if defined GPIOH_BASE
  PortH,
#endif
#if defined GPIOI_BASE
  PortI,
#endif
#if defined GPIOJ_BASE
  PortJ,
#endif
#if defined GPIOK_BASE
  PortK,
#endif
#if defined GPIOZ_BASE
  PortZ,
#endif
  PortEND,
  LastPort = PortEND - 1
} PortName;

#define MAX_NB_PORT (LastPort-FirstPort+1)

#ifdef __cplusplus
} // close extern "C" first to define constexpr
constexpr inline GPIO_TypeDef* constexpr_get_GPIO_Port(uint32_t p) {
  return (p == 0) ? GPIOA :
#if defined(GPIOB_BASE)
         (p == 1) ? GPIOB :
#endif
#if defined(GPIOC_BASE)
         (p == 2) ? GPIOC :
#endif
#if defined(GPIOD_BASE)
         (p == 3) ? GPIOD :
#endif
#if defined(GPIOE_BASE)
         (p == 4) ? GPIOE :
#endif
#if defined(GPIOF_BASE)
         (p == 5) ? GPIOF :
#endif
#if defined(GPIOG_BASE)
         (p == 6) ? GPIOG :
#endif
         (GPIO_TypeDef *)0;
}
extern "C" {
#endif

/* Return GPIO base address */
#ifdef __cplusplus
#define get_GPIO_Port(p) \
  (__builtin_constant_p(p) ? constexpr_get_GPIO_Port(p) : \
   ((p < MAX_NB_PORT) ? GPIOPort[p] : (GPIO_TypeDef *)NULL))
#else
#define get_GPIO_Port(p) ((p < MAX_NB_PORT) ? GPIOPort[p] : (GPIO_TypeDef *)NULL)
#endif
/* Enable GPIO clock and return GPIO base address */
GPIO_TypeDef *set_GPIO_Port_Clock(uint32_t port_idx);

#ifdef __cplusplus
}
#endif
#endif
